EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "60000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
4520
(
(19.969518 -7.2878287e-10 -0.017015562)
(20.816457 -1.6743172e-09 -0.026374355)
(21.97732 -3.4353881e-09 -0.037004188)
(23.412182 -4.2336477e-09 -0.052113897)
(25.359661 -5.2301212e-09 -0.07327744)
(28.034777 -4.6295456e-09 -0.099079945)
(31.584981 -5.3107905e-09 -0.12736882)
(36.162924 -6.0039705e-09 -0.15583228)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            noSlip;
    }
    inflow1
    {
        type            fixedValue;
        value           uniform (3.4396 0 0);
    }
    wall2
    {
        type            noSlip;
    }
    inflow2
    {
        type            fixedValue;
        value           uniform (3.4396 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            noSlip;
    }
}


// ************************************************************************* //
