EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "60000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
4520
(
100936.54
100915.93
100889.41
100858.2
100812.87
100743.29
100639.49
100487.36
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 101130;
        value           nonuniform List<scalar> 
24
(
100930.69
100930.73
100930.78
100930.84
100930.95
100931.18
100931.64
100932.54
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            zeroGradient;
    }
    inflow1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    inflow2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 84505;
    }
    wall3
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
