EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/g1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      g1;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4520
(
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
-0.0900000000000000
...
)
;

boundaryField
{
    axis
    {
        type            empty;
	}
    inlet
    {
        type            zeroGradient;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            zeroGradient;
    }
    inflow1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    inflow2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
