EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "60000";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
4520
(
(41.190715 -2.9068335e-08 -0.39943269 0 -52.861769 2.2640899e-06 -1.849267 -7.9100165e-06 -26.045563)
(94.377691 -1.1087466e-07 -0.86660057 0 -78.963567 5.0128269e-06 -2.2838715 -6.7297352e-06 -29.128089)
(119.1771 -1.0732486e-07 -1.1117173 5.9333911e-10 -106.98576 9.9323251e-06 -3.5374147 -4.9316163e-06 -36.538783)
(152.91904 -7.6463289e-08 -1.585691 0 -147.09829 1.1950024e-05 -4.2049034 -4.1581036e-06 -48.549015)
(207.39011 -1.6816232e-08 -2.0895243 0 -204.6088 1.4603799e-05 -5.2809427 -3.1094446e-06 -64.399409)
(279.54254 -5.6033517e-09 -2.4758932 -5.4406518e-10 -277.26494 1.2955308e-05 -6.9424227 -3.8932666e-06 -84.166059)
(368.51265 -6.7168813e-08 -2.7176121 0 -361.61515 1.5077967e-05 -8.9135612 -3.7024468e-06 -109.74583)
(478.62458 -1.0596467e-07 -2.8025514 0 -453.83304 1.7485468e-05 -11.071184 -3.3683772e-06 -144.52622)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(0.00059585209 2.5306486e-09 0.0083327162 0 -52.861769 2.2640899e-06 -1.862445 -7.9100064e-06 -26.045432)
(0.00069830168 3.6501841e-10 0.012242215 1.2592602e-10 -41.851998 8.8805648e-06 -2.0437574 -1.068319e-06 -35.829954)
(0.00058303964 -6.7297562e-10 0.012036127 1.5274031e-17 -39.975938 1.7580667e-06 -1.7708214 2.043977e-06 -36.556401)
(0.00067471881 -2.0319922e-10 0.012324745 5.2412355e-11 -39.237267 6.5005064e-07 -1.9996933 6.0223038e-07 -36.527379)
(0.00090483026 -1.2001018e-10 0.011957719 2.0723375e-11 -38.596811 1.4487485e-07 -2.7091889 3.5932734e-07 -35.803091)
(0.0013171971 -3.7333279e-11 0.01129655 0 -37.768838 1.0759897e-08 -3.9650585 1.1238154e-07 -34.005149)
(0.0019471129 -4.592221e-12 0.01008857 1.2802011e-17 -36.373618 -6.719307e-09 -5.8309833 1.3752201e-08 -30.212055)
(0.0027695194 2.0219883e-12 0.0077774138 0 -33.990431 -2.6955623e-09 -8.3007448 -6.0602605e-09 -23.310299)
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(-69.487951 2.6191181e-12 -1.5936092 -2.9594693e-13 0.29362962 -1.8011145e-12 -159146.69 -1.0554404e-08 -1725.811)
(-533.28304 -5.0840989e-11 2.7296486 -5.3051453e-15 -0.13407291 -1.9740659e-12 -53590.821 -1.1178631e-08 759.49475)
(-4294.0801 -7.5209558e-09 409.89212 0 -0.815806 -1.4829916e-11 -45707.142 -8.0543579e-08 4430.0902)
(-12454.003 -2.1003714e-08 2253.0086 0 -2.3283139 -2.1154186e-11 -66557.393 -1.0966371e-07 12075.258)
(-22759.012 1.6237924e-07 5816.096 5.2229096e-12 -4.4230693 1.2211816e-10 -85498.745 6.1039279e-07 21876.53)
(-34951.136 1.0563837e-07 11038.605 -6.3839794e-12 -7.0954687 6.9876818e-11 -105942.14 3.2018553e-07 33481.627)
(-50824.017 2.8801145e-07 18344.587 1.7660281e-11 -10.756972 1.6229189e-10 -134341.57 7.616438e-07 48507.284)
(-72613.943 3.8753959e-07 28436.56 1.3733271e-11 -15.986228 2.1252237e-10 -176281.63 9.4055503e-07 69047.493)
...
)
;
    }
    inflow1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(-209.72229 6.5532663e-10 1.0764144 0 0.11752111 -7.1547695e-11 7102.1116 8.9482302e-08 114.86616)
(-116.96651 2.6111656e-09 3.0875894 -3.2371379e-13 0.33741388 -2.8535877e-10 3782.3105 4.1741202e-08 86.128662)
(-58.186905 2.1405518e-09 4.514317 0 0.49303683 -2.3378392e-10 1962.9152 -1.6404967e-08 48.609403)
(-21.913791 1.8059775e-09 5.4304782 -1.9925744e-13 0.59175965 -1.9680408e-10 883.89015 -8.7216695e-09 21.897857)
(-3.6098765 1.5922993e-09 5.8531178 0 0.63530801 -1.7283001e-10 298.48277 -1.4584191e-08 5.229744)
(2.1698265 3.8029473e-10 5.8150984 0 0.62753433 -4.1032307e-11 58.602867 -1.4351711e-08 -2.6811581)
(2.564722 2.6774697e-12 5.4876957 0 0.58742791 -2.8612666e-13 0.63792573 -4.8949654e-09 -4.6165059)
(2.1453633 -4.5205746e-10 5.0243144 0 0.53186445 4.7859278e-11 -3.0997304 -8.2203566e-10 -4.3897375)
...
)
;
    }
    wall2
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
15
(
(-118.95204 3.3553557e-10 0.28398661 0 0.11752111 -7.1547695e-11 9284.7841 7.4347397e-08 122.12018)
(-15.256544 -7.2718858e-12 -0.26882955 -2.4091275e-14 0.01185019 -7.6548238e-11 3027.4447 7.9014802e-08 12.232041)
(-0.89162936 -3.2025532e-10 -0.014427429 0 0.0040489715 -6.9034172e-11 2578.7261 7.0813257e-08 4.1533169)
(1.4856246 8.3037903e-11 0.01665464 2.5622203e-14 0.0059844012 4.723333e-11 2650.3699 -4.8161889e-08 6.1020541)
(3.5226831 4.6289882e-10 0.047208943 0 0.010416911 -9.8890512e-11 3150.3019 1.0025362e-07 10.560509)
(6.7081336 1.5006908e-10 -0.56359442 -4.4225186e-14 0.024874608 -1.3234318e-10 4062.3163 1.3335138e-07 25.064155)
(367.87473 7.5745038e-09 -18.888126 0 -0.27889621 -1.678361e-10 6316.0947 1.6647807e-07 -276.27643)
(1408.4562 -5.6926282e-07 -759.02431 0 -1.6526909 1.2254726e-09 2761.3113 -1.0913453e-06 -1476.278)
(439.67961 -2.7954289e-06 -357.22746 1.0634446e-12 -0.85822019 6.7239512e-09 760.71557 -4.8475303e-06 -618.38982)
(1782.6726 5.929486e-07 -932.22333 -2.0655215e-12 -2.8711305 -1.8046212e-09 3066.998 1.0056224e-06 -1605.0792)
(3606.8775 6.0249342e-07 -1824.4295 -1.3069281e-12 -7.2528037 -2.4057027e-09 6206.6584 1.043546e-06 -3140.2455)
(6439.5528 5.6671097e-07 -3204.053 9.1963507e-13 -16.012048 -2.8446983e-09 11041.947 9.7775915e-07 -5496.3153)
(12163.829 8.4152247e-07 -5911.3647 2.1032357e-12 -35.694108 -5.1492211e-09 20848.256 1.4714389e-06 -10157.403)
(18066.738 5.9022474e-08 -7990.2626 1.0898431e-11 -52.487659 -3.2089824e-10 30265.461 7.0592996e-08 -12761.137)
(42328.734 1.406258e-06 -34977.69 -4.4054335e-12 -262.93999 -1.0610487e-08 69069.748 2.3858857e-06 -59017.465)
)
;
    }
    inflow2
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
79
(
(-0.0088211874 8.3679929e-14 -0.13907379 7.5715651e-17 -0.0015203109 -6.6407575e-14 -0.0013166632 -4.5121013e-13 -0.0077270948)
(-0.030003424 2.1315048e-11 -0.13768905 0 -0.0043955077 3.8529633e-14 -0.0012140861 3.074026e-12 0.012458172)
(-0.049073518 -1.3563933e-10 -0.13595124 0 -0.0070421484 -9.3631593e-13 0.0017863529 -2.4369502e-11 0.031090024)
(-0.066271514 6.6670386e-11 -0.13413414 2.532498e-14 -0.0095120974 5.2406881e-12 0.0070627494 4.5224297e-11 0.048494851)
(-0.083504165 -4.3567601e-11 -0.13265849 -2.560038e-14 -0.011848621 -3.4787517e-12 0.014174399 -2.9923339e-11 0.064919234)
(-0.1022359 -2.4684818e-10 -0.13199342 4.4759032e-14 -0.01426655 7.5768648e-12 0.023840751 2.0095886e-11 0.081649495)
(-0.12802551 6.3772696e-11 -0.13109197 0 -0.017116204 5.7599903e-12 0.037778737 4.8221738e-11 0.10108641)
(-0.15354977 -1.4910297e-10 -0.12146753 0 -0.020408906 3.9012435e-12 0.060023539 7.230576e-12 0.12452122)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
56
(
(0 0 0 -3.8518454e-10 5.3922927 2.1783709e-09 0.89416858 -2.0984128e-09 3.3144913)
(0 0 0 0 4.7596988 2.6073766e-09 0.88986962 -8.6635085e-10 4.4120693)
(0 0 0 6.8417676e-11 4.5583996 1.339423e-09 0.25570291 -1.0083438e-09 4.3830062)
(0 0 0 4.5837087e-11 4.5349564 1.5787385e-09 -0.46835063 -6.4145148e-10 4.5008773)
(0 0 0 3.3403573e-11 4.5348656 1.064217e-09 -1.249046 3.2772221e-10 4.5364357)
(0 0 0 0 4.5387292 8.2804727e-10 -2.0799543 2.5771407e-10 4.5537776)
(0 0 0 0 4.543849 6.1941542e-10 -2.9586337 2.2530997e-10 4.566567)
(0 0 0 0 4.5491972 5.1122213e-10 -3.8837079 2.434526e-10 4.5747654)
...
)
;
    }
    wall3
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 8((40681.886 5.2786721e-08 2919.6263 0 192.69099 -3.4835504e-09 -84927.495 1.2006714e-07 -15754.676) (39649.185 5.5655005e-08 2573.8244 0 166.91297 -3.6075105e-09 -76537.298 1.0446691e-07 -20630.538) (38035.156 5.9592494e-08 1953.6609 1.1310435e-27 124.97489 -3.8134624e-09 -68668.984 1.2117048e-07 -21655.13) (35709.616 6.530457e-08 1127.5513 3.1713978e-11 71.353589 -4.1312411e-09 -63058.261 1.4030772e-07 -20234.108) (32521.662 7.3878822e-08 55.9766 -1.8371685e-27 3.5159063 -4.6403256e-09 -58690.104 1.6310556e-07 -18809.579) (28458.968 8.6945167e-08 -1267.6576 -1.7766849e-11 -79.009934 -5.4177784e-09 -54534.632 1.9065439e-07 -17146.327) (23621.287 1.0641663e-07 -2790.1922 2.7397722e-27 -172.56594 -6.5813847e-09 -49143.606 2.2377e-07 -14945.657) (18414.902 1.3393664e-07 -4345.1331 1.5506716e-27 -266.58533 -8.2190579e-09 -41401.371 2.462907e-07 -11404.683));
    }
}


// ************************************************************************* //
