EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "60000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
8881
(
7.6601024e-08
-7.8381306e-09
8.6583069e-08
-1.0021293e-08
9.7364502e-08
-1.0721033e-08
1.0842637e-07
-1.1021568e-08
...
)
;

boundaryField
{
    axis
    {
        type            empty;
        value           nonuniform 0();
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
-6.8814204e-08
-3.9838769e-07
-1.35811e-06
-3.870413e-06
-9.8356934e-06
-2.2447059e-05
-4.5287362e-05
-7.8757125e-05
...
)
;
    }
    wedge1
    {
        type            wedge;
        value           nonuniform List<scalar> 
4520
(
8.4422649e-15
1.2021722e-14
2.0567676e-14
3.3450804e-14
4.2045269e-14
4.5929357e-14
4.1512263e-14
4.4890261e-14
...
)
;
    }
    wedge2
    {
        type            wedge;
        value           nonuniform List<scalar> 
4520
(
-8.2891772e-15
-1.1856878e-14
-2.0367901e-14
-3.3238019e-14
-4.1835918e-14
-4.5668822e-14
-4.1250886e-14
-4.459657e-14
...
)
;
    }
    wall1
    {
        type            calculated;
        value           uniform 0;
    }
    inflow1
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
-1.3439237e-06
-1.5085718e-06
-1.8562927e-06
-2.4309377e-06
-3.3054937e-06
-4.5927827e-06
-6.4628299e-06
-9.1708603e-06
...
)
;
    }
    wall2
    {
        type            calculated;
        value           uniform 0;
    }
    inflow2
    {
        type            calculated;
        value           nonuniform List<scalar> 
79
(
-0.0002368792
-0.00022436586
-0.00021521398
-0.00020930927
-0.00020658351
-0.00023493903
-0.00029400943
-0.0003271378
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
56
(
2.6376776e-07
8.3409539e-07
1.4740545e-06
2.1916137e-06
2.9957251e-06
3.8964581e-06
4.905154e-06
6.0346041e-06
...
)
;
    }
    wall3
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
