EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/0/timeScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "29500";
    object      timeScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];


internalField   nonuniform List<scalar> 
4520
(
0.00168974567781432
0.00208695204295857
0.00246954503352058
0.00285089065031168
0.00317174407387373
0.00347077122292784
0.00365344616753387
0.00378712949570095
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.0015;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar> 
24
(
1.49592195519058e-06
1.60859327255569e-06
1.70952692567391e-06
1.75085881375674e-06
1.73419544836715e-06
1.67219795470023e-06
1.57862956619451e-06
1.46630433230876e-06
...
)
;
    }
    inflow1
    {
        type            calculated;
        value           uniform 0.0015;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
9.60839469302226e-05
9.75515097822801e-05
9.87906522546121e-05
9.99780728090715e-05
0.000101132756656151
0.000102356083508234
0.000103590464133138
8.48500599741436e-05
8.42583531308866e-05
8.80099789938662e-05
9.10866792954704e-05
9.31659904446165e-05
9.36996777096516e-05
9.30934586736213e-05
8.54851768916983e-05
)
;
    }
    inflow2
    {
        type            calculated;
        value           uniform 0.0015;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            calculated;
        value           nonuniform List<scalar> 
8
(
0.000131704494331051
0.000132544910082534
0.000135103568916547
0.000140020836584705
0.000148692600975881
0.000162918079683682
0.000186681866602936
0.000226300293823097
)
;
    }
}


// ************************************************************************* //
