EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/foam_base/foam_base_ASJet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver GAMG;
        tolerance 1e-6;
        relTol 1e-3;
        smoother GaussSeidel; 
        nPreSweeps 0;
        nPostSweeps 2;
        cacheAgglomeration on;
        agglomerator faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels 1;
    }

    "(U|k|epsilon|omega)"
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-8;
        relTol 0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors    0;
    consistent      yes;         // SIMPLEC

    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|epsilon|omega)" 1e-8;
    }
}

relaxationFactors
{
    equations
    {
        p               0.3;
        ".*"            0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
